avr-rust/avrd/packs/tiny/ATtiny261.atdf
    <module caption="Lockbits" name="LOCKBIT">
      <register-group caption="Lockbits" name="LOCKBIT">
        <register caption="" name="LOCKBIT" offset="0x00" size="1">
          <bitfield caption="Memory Lock" mask="0x03" name="LB" values="ENUM_LB"/>
        </register>
      </register-group>
      <value-group caption="" name="ENUM_LB">
        <value caption="Further programming and verification disabled" name="PROG_VER_DISABLED" value="0x00"/>
        <value caption="Further programming disabled" name="PROG_DISABLED" value="0x02"/>
        <value caption="No memory lock features enabled" name="NO_LOCK" value="0x03"/>
      </value-group>
    </module>
    <module caption="I/O Port" name="PORT">
      <register-group caption="I/O Port" name="PORTA">
        <register caption="Port A Data Register" name="PORTA" offset="0x3B" size="1" mask="0xFF"/>
        <register caption="Port A Data Direction Register" name="DDRA" offset="0x3A" size="1" mask="0xFF"/>
        <register caption="Port A Input Pins" name="PINA" offset="0x39" size="1" mask="0xFF" ocd-rw="R"/>
      </register-group>
      <register-group caption="I/O Port" name="PORTB">
        <register caption="Port B Data Register" name="PORTB" offset="0x38" size="1" mask="0xFF"/>
        <register caption="Port B Data Direction Register" name="DDRB" offset="0x37" size="1" mask="0xFF"/>
        <register caption="Port B Input Pins" name="PINB" offset="0x36" size="1" mask="0xFF" ocd-rw="R"/>
      </register-group>
    </module>
    <module caption="Analog-to-Digital Converter" name="ADC">
      <register-group caption="Analog-to-Digital Converter" name="ADC">
        <register caption="The ADC multiplexer Selection Register" name="ADMUX" offset="0x27" size="1">
          <bitfield caption="Reference Selection Bits" mask="0xC0" name="REFS"/>
          <bitfield caption="Left Adjust Result" mask="0x20" name="ADLAR"/>
          <bitfield caption="Analog Channel and Gain Selection Bits" mask="0x1F" name="MUX"/>
        </register>
        <register caption="The ADC Control and Status register" name="ADCSRA" offset="0x26" size="1" ocd-rw="R">
          <bitfield caption="ADC Enable" mask="0x80" name="ADEN"/>
          <bitfield caption="ADC Start Conversion" mask="0x40" name="ADSC"/>
          <bitfield caption="ADC Auto Trigger Enable" mask="0x20" name="ADATE"/>
          <bitfield caption="ADC Interrupt Flag" mask="0x10" name="ADIF"/>
          <bitfield caption="ADC Interrupt Enable" mask="0x08" name="ADIE"/>
          <bitfield caption="ADC Prescaler Select Bits" mask="0x07" name="ADPS" values="ANALOG_ADC_PRESCALER"/>
        </register>
        <register caption="ADC Data Register  Bytes" name="ADC" offset="0x24" size="2" mask="0xFFFF"/>
        <register caption="ADC Control and Status Register B" name="ADCSRB" offset="0x23" size="1">
          <bitfield caption="Bipolar Input Mode" mask="0x80" name="BIN"/>
          <bitfield caption="Gain Select" mask="0x40" name="GSEL"/>
          <bitfield caption="Input Polarity Mode" mask="0x20" name="IPR"/>
          <bitfield caption="" mask="0x10" name="REFS2"/>
          <bitfield caption="" mask="0x08" name="MUX5"/>
          <bitfield caption="ADC Auto Trigger Sources" mask="0x07" name="ADTS" values="ANALOG_ADC_AUTO_TRIGGER3"/>
        </register>
        <register caption="Digital Input Disable Register 1" name="DIDR1" offset="0x22" size="1">
          <bitfield caption="ADC10 Digital input Disable" mask="0x80" name="ADC10D"/>
          <bitfield caption="ADC9 Digital input Disable" mask="0x40" name="ADC9D"/>
          <bitfield caption="ADC8 Digital input Disable" mask="0x20" name="ADC8D"/>
          <bitfield caption="ADC7 Digital input Disable" mask="0x10" name="ADC7D"/>
        </register>
        <register caption="Digital Input Disable Register 0" name="DIDR0" offset="0x21" size="1">
          <bitfield caption="ADC6 Digital input Disable" mask="0x80" name="ADC6D"/>
          <bitfield caption="ADC5 Digital input Disable" mask="0x40" name="ADC5D"/>
          <bitfield caption="ADC4 Digital input Disable" mask="0x20" name="ADC4D"/>
          <bitfield caption="ADC3 Digital input Disable" mask="0x10" name="ADC3D"/>
          <bitfield caption="AREF Digital Input Disable" mask="0x08" name="AREFD"/>
          <bitfield caption="ADC2 Digital input Disable" mask="0x04" name="ADC2D"/>
          <bitfield caption="ADC1 Digital input Disable" mask="0x02" name="ADC1D"/>
          <bitfield caption="ADC0 Digital input Disable" mask="0x01" name="ADC0D"/>
        </register>
      </register-group>
      <value-group caption="" name="ANALOG_ADC_PRESCALER">
        <value caption="2" name="VAL_0x00" value="0x00"/>
        <value caption="2" name="VAL_0x01" value="0x01"/>
        <value caption="4" name="VAL_0x02" value="0x02"/>
        <value caption="8" name="VAL_0x03" value="0x03"/>
        <value caption="16" name="VAL_0x04" value="0x04"/>
        <value caption="32" name="VAL_0x05" value="0x05"/>
        <value caption="64" name="VAL_0x06" value="0x06"/>
        <value caption="128" name="VAL_0x07" value="0x07"/>
      </value-group>
      <value-group caption="" name="ANALOG_ADC_AUTO_TRIGGER3">
        <value caption="Free Running mode" name="VAL_0x00" value="0x00"/>
        <value caption="Analog Comparator" name="VAL_0x01" value="0x01"/>
        <value caption="External Interrupt Request 0" name="VAL_0x02" value="0x02"/>
        <value caption="Timer/Counter0 Compare Match A" name="VAL_0x03" value="0x03"/>
        <value caption="Timer/Counter0 Overflow" name="VAL_0x04" value="0x04"/>
        <value caption="Timer/Counter1 Compare Match B" name="VAL_0x05" value="0x05"/>
        <value caption="Timer/Counter1 Overflow" name="VAL_0x06" value="0x06"/>
        <value caption="Watchdog Interrupt Request" name="VAL_0x07" value="0x07"/>
      </value-group>
    </module>
    <module caption="Analog Comparator" name="AC">
      <register-group caption="Analog Comparator" name="AC">
        <register caption="Analog Comparator Control And Status Register B" name="ACSRB" offset="0x29" size="1">
          <bitfield caption="Hysteresis Select" mask="0x80" name="HSEL"/>
          <bitfield caption="Hysteresis Level" mask="0x40" name="HLEV"/>
          <bitfield caption="Analog Comparator Multiplexer" mask="0x07" name="ACM"/>
        </register>
